Repository: inrae/ALAMODE-okp
Catalog: sphinx-doc/tm/okplm-level2.tmx
Source language: en_gb
Languages: fr_fr

source: To install the development branch of the project, after cloning the ``okplm`` package, change to the ``dev`` branch:
fr_fr: Pour installer la branche de développement du projet, après avoir cloné le paquet ``okplm``, passez à la branche ``dev``:

source: To obtain help on this function type "run_okp -h" in the command line.
fr_fr: Pour obtenir aide sur cette fonction tapez "run_okp -h" en ligne de commande.

source: To run ``okplm`` in the command line, change to the directory containing the input files and make:
fr_fr: Pour exécuter ``okplm`` en ligne de commande, changez au dossier qui contient les fichiers d'entrée et faites :

source: To run a python script from the command line, type:
fr_fr: Pour exécuter un script python script en ligne de commande, tapez :

source: To run the model, first define the names of the different input and output files.
fr_fr: Pour exécuter le modèle, d'abord définissez les noms des différents fichiers d'entrée et de sortie.

source: To tell the model the frequency of the input meteorological data and of the simulation you may use ``-d`` (daily), ``-w`` (weekly) or ``-n`` (monthly).
fr_fr: Pour communiquer au modèle quelle est la fréquence des données météorologiques d'entrée et de la simulation vous pouvez utiliser ``-d`` (journalière), ``-w`` (hebdomadaire) or ``-n`` (mensuelle).

source: To use ``okplm`` as a Python module you can simply import it and use the functions within::
fr_fr: Pour utiliser ``okplm`` comme un module Python vous pouvez simplement l'importer et utiliser les fonctions qu'il contient::

source: Translation
fr_fr: Traduction

source: Translation of the project's documentation
fr_fr: Traduction de la documentation du projet

source: Update of the translated documentation
fr_fr: Mise à jour de la documentation traduite

source: Usage
fr_fr: Utilisation

source: Using this method only the modified sections of text need to be translated again when modifications are made to the original documentation.
fr_fr: L'utilisation de cette méthode permet de traduire seulement les sections modifiées quand il y a des modifications de la modification originelle.

source: Validation is only implemented for 'daily' simulations.
fr_fr: La validation est implémentée uniquement pour simulations journalières.

source: We have followed the `PEP 08 -- Style Guide for Python Code <https://www.python.org/dev/peps/pep-0008/>`_.
fr_fr: Nous avons suivi la `Guide de style pour code Python PEP 08 <https://www.python.org/dev/peps/pep-0008/>`_.

source: We have followed the `PEP 257 -- Docstring Conventions <https://www.python.org/dev/peps/pep-0257/>`_ and the recommendations of the *Google Python Style Guide* for docstrings in functions (point `3.8.1 <http://google.github.io/styleguide/pyguide.html#383-functions-and-methods>`_).
fr_fr: Nous avons suivi les `Conventions Docstrings -- PEP 257 <https://www.python.org/dev/peps/pep-0257/>`_ et les recommandations de la *Google Python Style Guide* pour docstrings dans des fonctions (point `3.8.1 <http://google.github.io/styleguide/pyguide.html#383-functions-and-methods>`_).

source: Welcome to ``okplm``'s documentation!
fr_fr: Bienvenue à la documentation de ``okplm`` !

source: What is the ``okplm`` package?
fr_fr: Qu'est-ce que c'est le paquet ``okplm`` ?

source: When calling the function ``run_okp()``, you can specify the dates of start and end of the simulation by using the arguments ``start_date`` and ``end_date`` (or ``-s`` and ``-e`` in the command line).
fr_fr: Quand vous appelez la fonction ``run_okp()``, vous pouvez spécifier les dates de début et fin de simulation avec les arguments ``start_date`` et ``end_date`` (ou ``-s`` et ``-e`` en ligne de commande).

source: When doing so you need to be careful to maintain the reST formatting in the translated version.
fr_fr: Pendant que vous faites ça il faut faire attention à maintenir le formatage reST dans la version traduite.

source: Write dictionary to file.
fr_fr: Écrit dictionnaire à un fichier.

source: You can also compile the user manual as a pdf file making:
fr_fr: Vous pouvez compiler aussi le manuel d'utilisation en pdf avec :

source: You can do the translation by hand by modifying the po files.
fr_fr: Vous pouvez faire la traduction manuellement modifiant les fichiers po.

source: You can have multiple Python versions (2.x and 3.x) installed on the same system without problems using, for example, virtual environments.
fr_fr: Il est possible d'avoir plusieurs versions de Python (2.x et 3.x) installées sur le même système d'exploitation en utilisant, par exemple, les environnements virtuels.

source: You can include the previous commands in a Python script (see the example script ``test_script.py``).
fr_fr: Vous pouvez inclure les commandes précédentes dans un script Python (voyez le script d'exemple ``test_script.py``).

source: You can limit the length of the simulation by specifying the start and end dates:
fr_fr: Vous pouvez limiter la durée de la simulation spécifiant les dates de début et fin :

source: You can plot the simulation results with the function ``plotlyoutput()`` in the module ``tests/plotly_functions.py``, in addition to validation criteria (n, sd, r, me, mae et rmse) and observations, if they are available, with the instruction :
fr_fr: La fonction ``plotlyoutput()`` dans le script ``plotly_functions.py`` permet de visualiser les résultats des simulations ainsi que, le cas échéant, les valeurs des critères de validation (n, sd, r, me, mae et rmse) et les observations avec la formulation suivante :

source: You can specify other names using the optional arguments ``-m``, ``-l`` and ``-p``, respectively.
fr_fr: Vous pouvez spécifier d'autres noms de fichier avec les arguments optionnels ``-m``, ``-l`` et ``-p``, respectivement.

source: You can test the application with examples provided.
fr_fr: Vous pouvez tester l'application à l'aide des exemples de fichiers fournis.

source: You may also define a start, an end date and a periodicity for the simulations::
fr_fr: Vous pouvez aussi définir le début, la date de fin et la périodicité des simulations::

source: You may provide data for only one of tepi or thyp::
fr_fr: Vous pouvez fournier des données seulement pour une d'entre tepi et thyp::

source: You may use ``pip`` to install the required packages.
fr_fr: Vous pouvez utiliser ``pip`` pour installer les paquets requis.

source: You need Python 3.5 or later to run the ``okplm`` package.
fr_fr: Il est nécessaire d'avoir une version Python 3.5 ou ultérieure pour faire tourner le paquet ``okplm``.

source: You need to clone the ``okplm`` package with git.
fr_fr: Vous devez cloner le paquet ``okplm`` avec git.

source: ``okplm`` (Ottosson-Kettle-Prats lake model) is a package in Python 3 used to simulate the epilimnion and hypolimnion temperature of freshwater bodies using the Ottosson-Kettle-Prats (OKP) lake model (Prats & Danis, 2019).
fr_fr: ``okplm`` (modèle de lacs d'Ottosson-Kettle-Prats) est un paquet en Python 3 utilisé pour simuler la température de l'épilimnion et de l'hypolimnion des plans d'eau douce avec le modèle de lacs d'Ottosson-Kettle-Prats (OKP) (Prats & Danis, 2019).

source: a Python dictionary.
fr_fr: un dictionnaire Python.

source: a dictionary indicating the value of the independent variable 'altitude' (m).
fr_fr: un dictionnaire qui indique la valeur de la variable indépendante 'altitude' (m).

source: a dictionary indicating the value of the independent variable 'zmax' (m).
fr_fr: un dictionnaire qui indique la valeur de la variable indépendante 'zmax' (m).

source: a dictionary indicating the value of the independent variables 'altitude' (m), 'surface' (m\ :sup:`2`\), and 'volume' (m\ :sup:`3`\).
fr_fr: un dictionnaire qui indique la valeur des variables indépendantes 'altitude' (m), 'surface' (m\ :sup:`2`\), et 'volume' (m\ :sup:`3`\).

source: a dictionary indicating the value of the independent variables 'latitude' (degrees North), 'altitude' (m) and 'surface' (m\ :sup:`2`\).
fr_fr: un dictionnaire qui indique la valeur des variables indépendantes 'latitude' (dégrées Nord), 'altitude' (m) et 'surface' (m\ :sup:`2`\).

source: a dictionary indicating the value of the independent variables 'latitude' (degrees North), 'altitude' (m), 'zmax' (m), 'surface' (m\ :sup:`2`\ ), 'volume' (m\ :sup:`3`\).
fr_fr: un dictionnaire qui indique la valeur des variables indépendantes 'latitude' (dégrées Nord), 'altitude' (m), 'zmax' (m), 'surface' (m\ :sup:`2`\ ), 'volume' (m\ :sup:`3`\).

source: a dictionary indicating the value of the independent variables 'surface' (m\ :sup:`2`\) and 'volume' (m\ :sup:`3`\).
fr_fr: un dictionnaire qui indique la valeur des variables indépendantes 'surface' (m\ :sup:`2`\) et 'volume' (m\ :sup:`3`\).

source: a dictionary indicating the value of the parameter constants 'A1' to 'A4'.
fr_fr: un dictionnaire qui indique la valeur des constantes 'A1' à 'A4'.

source: a dictionary indicating the value of the parameter constants 'ALPHA1' to 'ALPHA4'.
fr_fr: un dictionnaire qui indique la valeur des constantes 'ALPHA1' à 'ALPHA4'.

source: a dictionary indicating the value of the parameter constants 'ALPHA1'-'ALPHA4', 'BETA1'-'BETA3', 'A1'-'A4', 'B1'-'B2', 'C1'-'C2', 'D', 'E1'-'E3'.
fr_fr: un dictionnaire qui indique la valeur des constantes 'ALPHA1'-'ALPHA4', 'BETA1'-'BETA3', 'A1'-'A4', 'B1'-'B2', 'C1'-'C2', 'D', 'E1'-'E3'.

source: a dictionary indicating the value of the parameter constants 'B1' to 'B2'.
fr_fr: un dictionnaire qui indique la valeur des constantes 'B1' à 'B2'.

source: a dictionary indicating the value of the parameter constants 'BETA1' to 'BETA3'.
fr_fr: un dictionnaire qui indique la valeur des constantes 'BETA1' à 'BETA3'.

source: a dictionary indicating the value of the parameter constants 'C1' to 'C2'.
fr_fr: un dictionnaire qui indique la valeur des constantes 'C1' à 'C2'.

source: a dictionary indicating the value of the parameter constants 'E1' to 'E3'.
fr_fr: un dictionnaire qui indique la valeur des constantes 'E1' à 'E3'.

source: a dictionary with values for the parameters BETA, A, D and E.
fr_fr: un dictionnaire avec valeurs des paramètres BETA, A, D et E.

source: altitude: altitude above sea level (m)
fr_fr: altitude : altitude sur le niveau de la mer (m)

source: array of response data.
fr_fr: array de données de réponse.

source: array of time data.
fr_fr: array de données de temps.

source: array with simulated values.
fr_fr: array avec des valeurs simulées.

source: at_factor: multiplicative factor of air temperature.
fr_fr: at_factor: facteur multiplicatif de la température de l'air

source: calc_epilimnion_temperature: calculate epilimnion temperature.
fr_fr: calc_epilimnion_temperature : calcule la température de l'épilimnion.

source: calc_hypolimnion_temperature: calculate hypolimnion temperature.
fr_fr: calc_hypolimnion_temperature : calcule la température de l'hypolimnion.

source: daily air temperature (ºC).
fr_fr: température de l'air journalière (ºC).

source: daily epilimnion temperature (ºC).
fr_fr: température de l'épilimnion journalière (ºC).

source: daily solar radiation (W/m\ :sup:`2`\ ).
fr_fr: rayonnement solaire journalier (W/m\ :sup:`2`\ ).

source: daily_f: apply function on daily periods.
fr_fr: daily_f : applique fonction sur des périodes journalières.

source: data sequence, the same length of t.
fr_fr: séquence de données de la même longitude que t.

source: date of end of the simulation in the format 'YYYY-mm-dd'.
fr_fr: date de finalisation de la simulation avec le format 'AAAA-mm-jj'.

source: date of start of the simulation in the format 'YYYY-mm-dd'.
fr_fr: date de début de la simulation avec le format 'AAAA-mm-jj'.

source: date: date in the format 'yyyy-mm-dd'.
fr_fr: date : date avec le format 'aaaa-mm-jj'.

source: datetime sequence at daily or subdaily frequency.
fr_fr: séquence de type datetime à fréquence journalière ou infra-journalière.

source: datetime sequence at daily/subdaily frequency.
fr_fr: séquence de type datetime à fréquence journalière ou infra-journalière.

source: datetime sequence at subdaily frequency.
fr_fr: séquence de type datetime à fréquence infra-journalière.

source: depth (m)
fr_fr: profondeur (m)

source: error_statistics: calculate error statistics.
fr_fr: error_statistics : calcule statistiques d'erreur.

source: estimate_par_a: estimate parameter A.
fr_fr: estimate_par_a : estime le paramètre A.

source: estimate_par_alpha: estimate parameter alpha.
fr_fr: estimate_par_alpha : estime le paramètre alpha.

source: estimate_par_b: estimate parameter B.
fr_fr: estimate_par_b : estime le paramètre B.

source: estimate_par_beta: estimate parameter beta.
fr_fr: estimate_par_beta : estime le paramètre beta.

source: estimate_par_c: estimate parameter C.
fr_fr: estimate_par_c : estime le paramètre C.

source: estimate_par_e: estimate parameter E.
fr_fr: estimate_par_e : estime le paramètre E.

source: estimate_parameters: estimate OKP parameter values.
fr_fr: estimate_parameters : estime les valeurs des paramètres d'OKP.

source: estimated parameter values (if not provided by the user), saved to the file ``par_file`` described above.
fr_fr: valeurs estimées des paramètres (si non fournies par utilisateur), sauvegardées au fichier ``par_file`` décrit ci-dessus.

source: examples/synthetic_case_given : daily data
fr_fr: examples/synthetic_case_given : données journalières

source: fit_sinusoidal: fit a sinusoidal function.
fr_fr: fit_sinusoidal : cale une fonction sinusoïdale.

source: indicators of simulation performance (if validation data is provided), saved to the file ``validation_res_file``.
fr_fr: indicateurs de la performance des simulations (s'il y a des données de validation), sauvegardés dans le fichier ``validation_res_file``.

source: initial date in datetime format.
fr_fr: date initiale en format datetime.

source: last date in datetime format.
fr_fr: date finale en format datetime.

source: length of the period in time units.
fr_fr: longueur de la période en unités de temps.

source: list or array of dates in datetime format.
fr_fr: liste ou array de dates en format datetime.

source: mae: mean absolute error.
fr_fr: mae : erreur absolue moyenne.

source: main: parse command line arguments and run the OKP model.
fr_fr: main : analyse les arguments en ligne de commande et exécute le modèle OKP.

source: mat: mean annual air temperature (ºC).
fr_fr: mat : température moyenne annuelle de l'air (ºC).

source: me: mean error.
fr_fr: me : erreur moyenne.

source: monthly_f: apply function on monthly periods.
fr_fr: monthly_f : applique fonction sur des périodes mensuelles.

source: n: number of measurements.
fr_fr: n : nombre de mesures.

source: name: lake name or code (optional, to identify the lake)
fr_fr: name : nom ou code du lac (optionnel, pour identifier le lac)

source: observed values.
fr_fr: valeurs observées.

source: path of text file.
fr_fr: chemin du fichier texte.

source: path of the file containing observational data to calculate error statistics.
fr_fr: chemin du fichier contenant données observées pour calculer les statistiques d'erreur.

source: path of the file where validation results will be written.
fr_fr: chemin du fichier où écrire les résultats de la validation.

source: path of the lake data file (optional, it is only necessary if par_file is not provided).
fr_fr: chemin fichier de données de lac (optionnel, seulement nécessaire si par_file n'est pas muni).

source: path of the meteorological data file.
fr_fr: chemin du fichier de données météorologiques.

source: path of the output file.
fr_fr: chemin du fichier de sortie.

source: path of the parameter file.
fr_fr: chemin du fichier de paramètres.

source: path of the text file to write the data.
fr_fr: chemin du fichier texte où écrire les données.

source: periodicity of the input epilimnion temperature data and of the simulation; it can take the values 'daily', 'weekly', 'monthly'.
fr_fr: fréquence des données d'entrée de la température de l'épilimnion et de la simulation ; les valeurs possibles sont 'daily' (journalière), 'weekly' (hebdomadaire), 'monthly' (mensuelle).

source: periodicity of the input meteorological data and of the simulation; it can take the values 'daily', 'weekly', 'monthly'.
fr_fr: fréquence des données météorologiques d'entrée et de la simulation ; les valeurs possibles sont 'daily' (journalière), 'weekly' (hebdomadaire), 'monthly' (mensuelle).

source: periodicity of the output data (only implemented for daily simulations); it can take the values 'daily', 'weekly', 'monthly'.
fr_fr: fréquence des données de sortie (implémentée seulement pour simulations journalières) ; les valeurs possibles sont 'daily' (journalière), 'weekly' (hebdomadaire), 'monthly' (mensuelle).

source: r: correlation coefficient.
fr_fr: r : coefficient de corrélation.

source: read_dict: read lake or parameter file to dictionary.
fr_fr: read_dict : lit un fichier de lac ou de paramètres dans un dictionnaire.

source: rmse: root mean square error.
fr_fr: rmse : racine carrée de l'erreur quadratique moyenne.

source: run_okp: run the OKP model.
fr_fr: run_okp : exécute le modèle OKP.

source: sd: standard deviation.
fr_fr: sd : déviation standard.

source: select_daterange: return indices between two dates.
fr_fr: select_daterange : retourne les indices entre deux dates.

source: sr: mean daily solar radiation (W m\ :sup:`-2`\ ).
fr_fr: sr : rayonnement solaire journalier moyen (W/m\ :sup:`2`\ ).

source: surface: lake surface area (m\ :sup:`2`\ )
fr_fr: surface : aire de surface du lac (m\ :sup:`2`\ )

source: sw_factor: multiplicative factor of shortwave radiation.
fr_fr: sw_factor: facteur multiplicatif du rayonnement solaire.

source: synthetic_case_daily : daily data
fr_fr: synthetic_case_daily : données journalières

source: synthetic_case_monthly: monthly data
fr_fr: synthetic_case_monthly : données mensuelles

source: synthetic_case_weekly: weekly data
fr_fr: synthetic_case_weekly : données hebdomadaires

source: tair: mean daily air temperature (ºC).
fr_fr: tair : température de l'air journalière moyenne (ºC).

source: tepi: epilimnion temperature (ºC) (optional).
fr_fr: tepi : température de l'épilimnion (ºC) (optionnelle).

source: tepi: epilimnion temperature (ºC).
fr_fr: tepi : température de l'épilimnion (ºC).

source: test_okp_model.py: to test the function ``run_okp()``, main function used to run the simulations.
fr_fr: test_okp_model.py : pour tester la ``run_okp()``, fonction principale utilisée pour lancer les simulations.

source: test_validation.py: to test the function ``error_statistics()``, function used for the validation of simulation results.
fr_fr: test_validation.py : pour tester la fonction ``error_statistics()``, fonction utilisée pour la validation des résultats de simulation.

source: the function to be used (sum, numpy.mean, etc.).
fr_fr: la fonction à utiliser (sum, numpy.mean, etc.).

source: thyp: hypolimnion temperature (ºC) (optional).
fr_fr: thyp : température de l'hypolimnion (ºC) (optionnelle).

source: thyp: hypolimnion temperature (ºC).
fr_fr: thyp : température de l'hypolimnion (ºC).

source: time array of observed data.
fr_fr: array de temps des données observées.

source: time array of the simulated data.
fr_fr: array de temps des données simulées.

source: type of input data, "daily" or "subdaily".
fr_fr: type de données d'entrée, "daily" (journalières) or "subdaily" (infra-journalières).

source: type: lake type; it can be 'L' for lakes (surface outlet) or 'R' for reservoirs (submerged outlet)
fr_fr: type : type de lac ; il peut être 'L' pour les lacs (exutoire en surface) ou 'R' pour les réservoirs (exutoire submergé)

source: value of the parameter E [0 - 1].
fr_fr: valeur du paramètre E [0 - 1].

source: volume: lake volume (m\ :sup:`3`\ )
fr_fr: volume : volume du lac (m\ :sup:`3`\ )

source: water temperature (ºC).
fr_fr: température de l'eau (ºC).

source: water temperature simulations, saved to the file ``output_file``.
fr_fr: simulations de température de l'eau, sauvegardées au fichier ``output_file``.

source: water_density: calculate water density.
fr_fr: water_density : calcule la densité de l'eau.

source: weekly_f: apply function on weekly periods.
fr_fr: weekly_f : applique fonction sur des périodes hebdomadaires.

source: write_dict: write dictionary to file.
fr_fr: write_dict : écrit dictionnaire dans un fichier.

source: zmax: lake depth (m)
fr_fr: zmax : profondeur du lac (m)
